## Joining Tables - Outer

Let us understand how to perform outer joins using SQL. 

There are 3 different types of outer joins :
* `LEFT OUTER JOIN` (default) - Get all the records from both the datasets which satisfies JOIN condition along with those records which are in the left side table but not in the right side table.
* `RIGHT OUTER JOIN` - Get all the records from both the datasets which satisfies JOIN condition along with those records which are in the right side table but not in the left side table.
* `FULL OUTER JOIN` - left union right

* When we perform the outer join (lets say left outer join), we will see this :
  * Get all the values from both the tables when join condition satisfies.
  * If there are rows on left side table for which there are no corresponding values in right side table, all the projected column values for right side table will be null.

* Here are some of the examples for outer join :
    * Get all the orders where there are no corresponding order items.
    * Get all the order items where there are no corresponding orders.

In [1]:
%load_ext sql

In [2]:
%env DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

env: DATABASE_URL=postgresql://suryakantkumar:None@localhost:5432/suryakantkumar

* Get all items ordered for each order id

In [3]:
%%sql

SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_order_id,
    oi.order_item_subtotal
FROM 
    orders o 
    LEFT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
ORDER BY 
    o.order_id
LIMIT 
    10

10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 1, 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 129.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 199.99),
 (3, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 199.92),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 49.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.98)]

* Get Count of items ordered

In [4]:
%%sql

SELECT
    count(1)
FROM 
    orders o
    LEFT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(183650,)]

* Get order Ids for all the Null Item values

In [5]:
%%sql

SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_order_id,
    oi.order_item_subtotal
FROM 
    orders o 
    LEFT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    oi.order_item_order_id IS NULL
ORDER BY 
    o.order_id
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(3, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (6, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (22, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (26, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (32, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', None, None),
 (40, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', None, None),
 (47, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', None, None),
 (53, datetime.datetime(2013, 7, 25, 0, 0), 'PROCESSING', None, None),
 (54, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', None, None),
 (55, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING', None, None)]

* Get Count of order Items Where Item Id is Null

In [6]:
%%sql

SELECT 
    count(1)
FROM 
    orders o 
    LEFT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    oi.order_item_order_id IS NULL

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(11452,)]

* Identifying anomalies in order items table since there are null order items for completed or closed orders

In [7]:
%%sql

SELECT 
    count(1)
FROM 
    orders o 
    LEFT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    oi.order_item_order_id IS NULL
    AND 
    o.order_status IN ('COMPLETE', 'CLOSED')

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(5189,)]

* Perform Right Join on Order Items

In [8]:
%%sql

SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_order_id,
    oi.order_item_subtotal
FROM 
    orders o 
    RIGHT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
10 rows affected.

[(1, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 1, 299.98),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 199.99),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 250.0),
 (2, datetime.datetime(2013, 7, 25, 0, 0), 'PENDING_PAYMENT', 2, 129.99),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 49.98),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 299.95),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 150.0),
 (4, datetime.datetime(2013, 7, 25, 0, 0), 'CLOSED', 4, 199.92),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.98),
 (5, datetime.datetime(2013, 7, 25, 0, 0), 'COMPLETE', 5, 299.95)]

* Get Count of values on Right Join

In [9]:
%%sql

SELECT 
    count(1)
FROM 
    orders o 
    RIGHT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
1 rows affected.

[(172198,)]

* There is no anomaly in orders table

In [10]:
%%sql

SELECT 
    o.order_id,
    o.order_date,
    o.order_status,
    oi.order_item_order_id,
    oi.order_item_subtotal
FROM 
    orders o 
    RIGHT OUTER JOIN 
    order_items oi
        ON o.order_id = oi.order_item_order_id
WHERE 
    o.order_id IS NULL
LIMIT 
    10

 * postgresql://suryakantkumar:***@localhost:5432/suryakantkumar
0 rows affected.

[]